src/integ-test/bdd-test/resources/xml/paGetPayment_5transfer_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paGetPaymentRes>
            <outcome>$outcome</outcome>
            <data>
                <creditorReferenceId>$creditorReferenceId</creditorReferenceId>
                <paymentAmount>$paymentAmount</paymentAmount>
                <dueDate>$dueDate</dueDate>
                <description>$description</description>
                <debtor>
                    <uniqueIdentifier>
                        <entityUniqueIdentifierType>$entityUniqueIdentifierType</entityUniqueIdentifierType>
                        <entityUniqueIdentifierValue>$entityUniqueIdentifierValue</entityUniqueIdentifierValue>
                    </uniqueIdentifier>
                    <fullName>$fullName</fullName>
                </debtor>
                <transferList>
                    <transfer>
                        <idTransfer>1</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA1</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>2</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA2</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>3</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA3</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>4</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA4</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>5</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA5</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                </transferList>
            </data>
        </paf:paGetPaymentRes>
    </soapenv:Body>
</soapenv:Envelope>